#+TITLE: backtrace
#+author: Warren Wilkinson
#+email: warrenwilkinson@gmail.com
#+LATEX_CLASS: tufte

# Repository: https://github.com/WarrenWilkinson/backtrace

** test.lisp

#+NAME: result-runner-and-printer
#+BEGIN_SRC lisp
  (defvar *all-tests* nil)
        
  (defstruct results
    (tests 0)
    (failures nil))
  (defun results-failure-count (results)
    (length (results-failures results)))
  (defun results-successes (results)
    (- (results-tests results)
       (results-failure-count results)))
  
  (defun runtest (fun results)
    (let* ((success t)
           (output (with-output-to-string (*standard-output*)
                     (setf success (funcall fun)))))
      (make-results
       :tests (1+ (results-tests results))
       :failures (if success
                     (results-failures results)
                     (acons fun output (results-failures results))))))
  
  (defun present-failures (results)
    (format t "~%BACKTRACE FAILURES:~%")
    (loop for (fn . problems) in (results-failures results)
          do (format t "~%~a~a~%" fn problems)))
  (defun present-results (results)
    (format t "~%BACKTRACE TEST RESULTS:")
    (format t "~%     Tests: ~a~%   Success: ~a~%  Failures: ~a" 
            (results-tests results)
            (results-successes results)
            (results-failure-count results))
    (when (results-failures results)
      (present-failures results)))
    
  (defun run-tests ()
    (format t "~%RUNNING BACKTRACE TESTS...")
    (present-results 
     (reduce #'(lambda (test results) (runtest test results))
             *all-tests* :from-end t :initial-value (make-results))))     
#+END_SRC


#+NAME: tangle-tests(table=simpleTests)
#+begin_src emacs-lisp 
    (defun row-to-test (row)
      (let ((name (first row))
            (variables (second row))
            (depth (third row))
            (regex (fourth row))
            (comment (fifth row)))
        (format "(deftest %14s :vars %3s :depth %2d :regex %24S :comment %S)"
                name variables depth regex comment)))
  
    (mapconcat #'row-to-test (cdr (remove 'hline table)) "\n")
#+end_src

#+RESULTS: tangle-tests
: (deftest  variables-off :vars nil :depth  6 :regex                  "!with" :comment "When variables are disabled, we shouldn't see any.")
: (deftest   variables-on :vars   t :depth  6 :regex                   "with" :comment "When enabled, we should see some.")
: (deftest tertiary-first :vars nil :depth  1 :regex                  "!BETA" :comment "Tertiary should be first.")
: (deftest    beta-second :vars nil :depth  2 :regex                 "!ALPHA" :comment "Beta should be second")
: (deftest    alpha-third :vars nil :depth  3 :regex                  "ALPHA" :comment "Alpha should be second")
: (deftest    tertiary-fp :vars nil :depth  1 :regex  "test-functions.lisp@4" :comment "Correct file location for tertiary")
: (deftest        beta-fp :vars nil :depth  2 :regex  "test-functions.lisp@8" :comment "Correct file location for beta")
: (deftest       alpha-fp :vars nil :depth  3 :regex "test-functions.lisp@12" :comment "Correct file location for alpha")

#+begin_src lisp :tangle test.lisp :noweb yes
  ;;; -*- Mode: LISP; Syntax: COMMON-LISP; Package: BACKTRACE.TEST; Base: 10 -*-
  
  <<copyright>>
  
  (defpackage :backtrace.test
    (:use :common-lisp :backtrace)
    (:export run-tests))
  
  (in-package :backtrace.test)

  <<result-runner-and-printer>>  

  (defun test-setup (depth vars)
     (with-output-to-string (s)
        (with-printable-backtrace (s :depth depth :variables vars)
            (alpha 4 5))))
   
  (defun quick-test (depth vars)
     (handler-bind ((error (lambda (c) (declare (ignore c)) (invoke-restart (find-restart 'backtrace)))))
       (test-setup depth vars))) ;; Invoke restart

  (defmacro deftest (name &key (vars nil) (depth 6) (regex "") (comment ""))
    `(progn 
       (defun ,name ()
           ,comment 
           (let ((backtrace (quick-test ,depth ,vars)))
              (or ,(if (char= #\! (char regex 0))
                       `(not (cl-ppcre:scan ,(subseq regex 1) backtrace))
                       `(cl-ppcre:scan ,regex backtrace))
                  (prog1 nil (format t "Regex ~s did not match backtrace:~%~a" ,regex backtrace)))))
       (pushnew ',name *all-tests*)))

  ;; Generated tests
  <<tangle-tests(simpleTests)>>

  <<ensure-restart-test>>

#+end_src

